#+TITLE: rob25conf
#+AUTHOR: Roberto
#+DESCRIPTION: A primer for a personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* MODELINE

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :box nil)
(set-face-attribute 'mode-line-inactive nil :box nil)   

;; (use-package doom-modeline
;;   :ensure t
;;   :init (doom-modeline-mode 1)
;;   :config
;;   (setq doom-modeline-height 30
;; 	doom-modeline-bar-width 5
;; 	doom-modeline-persp-name t
;; 	doom-modeline-persp-icon t))

;; (use-package anzu
;;   :defer 1
;;   :after isearch
;;   :ensure t
;;   :config
;;   (global-anzu-mode 1))

;; (use-package minions
;;   :defer 1
;;   :ensure t
;;   :config
;;   (minions-mode 1))

;; (use-package doom-modeline
;;   :demand t
;;   :ensure t
;;   :custom
;;   (inhibit-compacting-font-caches t)
;;   (doom-modeline-height 28)
;;   ;; 1 minor mode will be shown thanks to minions
;;   (doom-modeline-minor-modes t)
;;   (doom-modeline-hud t)
;;   :config
;;   (doom-modeline-mode 1))
#+end_src

#+RESULTS:
: [nil 26846 60959 34353 nil elpaca-process-queues nil nil 49000 nil]

